docs/math/infinity.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Infinities</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Infinities</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-5fcbc798-db30-462d-a27b-f72463fcdb16">1. Real Infinity</a>
<ul>
<li><a href="#h-96a7c44d-37d7-47b7-b9f5-d1a61046afac">1.1. IEEE Floating Point</a></li>
<li><a href="#h-7200bf6a-9a3e-4f8b-b62e-693a46d22564">1.2. Extended Real Numbers</a></li>
<li><a href="#h-e283f7af-bd02-4836-a659-5f6713eb49e5">1.3. Projective Real Number Line</a></li>
<li><a href="#h-d7baa693-13dc-46bf-b09e-f335603570d5">1.4. Hyperreal and Infinitesimals</a></li>
</ul>
</li>
<li><a href="#h-a531f251-74c6-4411-9af9-00c23e551476">2. Complex Infinity</a></li>
<li><a href="#h-02fd2774-db86-4ec4-aa92-2257c9c0c77a">3. History</a></li>
<li><a href="#h-92c628a0-014d-40ef-9356-8ec5dfa417b3">4. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-5fcbc798-db30-462d-a27b-f72463fcdb16" class="outline-2">
<h2 id="h-5fcbc798-db30-462d-a27b-f72463fcdb16"><span class="section-number-2">1.</span> Real Infinity</h2>
<div class="outline-text-2" id="text-h-5fcbc798-db30-462d-a27b-f72463fcdb16">
<p>
There are two infinities on the real number line, positive and
negative infinity. In Lisp, these are represented by the constants
</p>

<pre id="ex-lisp-infty" class="example">
GSLL:+POSITIVE-INFINITY+

GSLL:+NEGATIVE-INFINITY+
</pre>

<p>
The exact nature of infinity is debatable (e.g., is it a number or
a label for nonconvergent series?). As far as computation is
concerned, it acts like a number.
</p>
</div>
<div id="outline-container-h-96a7c44d-37d7-47b7-b9f5-d1a61046afac" class="outline-3">
<h3 id="h-96a7c44d-37d7-47b7-b9f5-d1a61046afac"><span class="section-number-3">1.1.</span> IEEE Floating Point</h3>
<div class="outline-text-3" id="text-h-96a7c44d-37d7-47b7-b9f5-d1a61046afac">
<p>
There are two infinities in IEEE-754 floating point, a positive and a
negative infinity. For any finite positive \(x\), we have
</p>

<ul class="org-ul">
<li>Addition/Subtraction rules
<ul class="org-ul">
<li>\(\pm x+\infty = \infty\)</li>
<li>\(\pm x-\infty = -\infty\)</li>
<li>\(\infty + \infty = \infty - (-\infty) = \infty\)</li>
<li>\(-\infty - \infty = -\infty + (-\infty) = -\infty\)</li>
</ul></li>
<li>Multiplication rules
<ul class="org-ul">
<li>\(x\infty = (-x)(-\infty) = \infty\)</li>
<li>\((-x)\infty = x(-\infty) = -\infty\)</li>
<li>\((-\infty)\infty = \infty(-\infty) = -\infty\)</li>
<li>\(\infty\infty = (-\infty)(-\infty) = \infty\)</li>
</ul></li>
<li>Division rules
<ul class="org-ul">
<li>\(\pm x/\infty = \pm x/(-\infty) = 0\)</li>
<li>\(\pm x/0 = \pm\infty\)</li>
<li>\(\pm x/(-0) = \mp\infty\)</li>
<li>\(0/\infty = 0\)</li>
</ul></li>
</ul>

<p>
All other operations produce a <code>NaN</code> ("Not-a-Number") special value.
</p>
</div>
</div>
<div id="outline-container-h-7200bf6a-9a3e-4f8b-b62e-693a46d22564" class="outline-3">
<h3 id="h-7200bf6a-9a3e-4f8b-b62e-693a46d22564"><span class="section-number-3">1.2.</span> Extended Real Numbers</h3>
<div class="outline-text-3" id="text-h-7200bf6a-9a3e-4f8b-b62e-693a46d22564">
<p>
We can treat them like numbers, which gives us the extended real
number line. The extended reals have the additional rules for
operators when at most 1 operand is infinite. The basic operations are
</p>

<ul class="org-ul">
<li>\(a+\infty = \infty + a = \infty\) for finite \(a\)</li>
<li>\(a-\infty = -\infty+ a = -\infty\) for finite \(a\)</li>
<li>\(a\times(\pm\infty) = \pm\infty\) for \(0\lt a\lt+\infty\)</li>
<li>\(a\times(\pm\infty) = \mp\infty\) for \(-\infty\lt a\lt 0\)</li>
<li>\(a/(\pm\infty) = 0\) for finite \(a\)</li>
<li>\((\pm\infty)/a = \pm\infty\) for \(0\lt a\lt\infty\)</li>
<li>\((\pm\infty)/a = \mp\infty\) for \(-\infty\lt a\lt 0\)</li>
<li>\(a^{\infty} = \infty\) and \(a^{-\infty}=0\) for \(1\lt a\lt\infty\)</li>
<li>\(0^{a} = 0\) and \((+\infty)^{a}=\infty\) for \(0\lt a\lt\infty\)</li>
<li>\(0^{a} = \infty\) and \((+\infty)^{a}=0\) for \(-\infty\lt a\lt 0\)</li>
</ul>

<p>
When both are infinite in disagreeable ways, like \(\infty - \infty\),
the operation is undefined. For agreeable situations, we could
define the operation, like \(\infty + \infty = \infty\).
</p>

<div id="xca-extended-reals-monoid" class="exercise">
<p>
Prove or find a counter-example: the extended reals form a monoid.
</p>

</div>
</div>
</div>
<div id="outline-container-h-e283f7af-bd02-4836-a659-5f6713eb49e5" class="outline-3">
<h3 id="h-e283f7af-bd02-4836-a659-5f6713eb49e5"><span class="section-number-3">1.3.</span> Projective Real Number Line</h3>
<div class="outline-text-3" id="text-h-e283f7af-bd02-4836-a659-5f6713eb49e5">
<p>
Another approach is to use the projective real number
line. Intuitively, look at the plane \(\mathbb{R}^{2}\) and take the
$x$-axis as the real number system. Now construct a unit circle
centered at the point \((0, 1)\).
</p>

<p>
We can associate each point on the $x$-axis with a point on the
circle by constructing a line from our point \((x,0)\) and connecting
it to the North pole of the circle \((0, 2)\). This line will
intersect the circle exactly once (besides the North pole), and
that intersection point is identified with the point on the number
line.
</p>

<p>
We can then "complete" the number line with an additional infinity,
namely, the North pole of this circle.
</p>

<p>
But this identifies positive infinity with negative infinity:
they're both mapped to the North pole.
</p>
</div>
</div>
<div id="outline-container-h-d7baa693-13dc-46bf-b09e-f335603570d5" class="outline-3">
<h3 id="h-d7baa693-13dc-46bf-b09e-f335603570d5"><span class="section-number-3">1.4.</span> Hyperreal and Infinitesimals</h3>
<div class="outline-text-3" id="text-h-d7baa693-13dc-46bf-b09e-f335603570d5">
<p>
We could use hyperreals to extend the real number system with
infinitesimals and, for closure under division, infinities. This
attempts to emulate the use of infinitesimals we find in Leibniz
and Newton.
</p>

<p>
Dual numbers are slightly simpler, and correspond to
\(\mathbb{R}[\varepsilon]/(\varepsilon^{2})\). Or if you prefer,
adding a number \(\varepsilon\) treated as a variable, but whose
square is zero. We can extend smooth functions on the real number
system to the dual reals by \(f\colon\mathbb{R}\to\mathbb{R}\) having
\(f(a+\varepsilon b) = f(a) + b\varepsilon f'(a)\) where \(f'(x)\) is
the derivative of \(f\).
</p>

<p>
The mathematicians who study hyperreals use insanely sophisticated
methods (I'm thinking of smooth infinitesimal analysis, which
requires category theory for simple calculus). I'm not sure the
juice is worth the squeeze.
</p>
</div>
</div>
</div>
<div id="outline-container-h-a531f251-74c6-4411-9af9-00c23e551476" class="outline-2">
<h2 id="h-a531f251-74c6-4411-9af9-00c23e551476"><span class="section-number-2">2.</span> Complex Infinity</h2>
<div class="outline-text-2" id="text-h-a531f251-74c6-4411-9af9-00c23e551476">
<p>
Wolfram's <i>Mathematica</i> uses \(\widetilde{\infty}\) as an infinite
numerical quantity whose direction in the complex plane is unknown or
undetermined, called <a href="https://functions.wolfram.com/Constants/ComplexInfinity/introductions/Symbols/ShowAll.html">Complex Infinity</a>. (This is idiosyncratic terminology.)
On the Riemann sphere, it is the north pole. In the
projective complex plane, it is the line at infinity.
</p>

<p>
It has the property that, for any finite positive \(x\),
</p>
\begin{equation}
\widetilde{\infty}\pm x = \widetilde{\infty}
\end{equation}
\begin{equation}
\widetilde{\infty}\times\widetilde{\infty}=\widetilde{\infty}
\end{equation}
\begin{equation}
x/\widetilde{\infty}=0/\widetilde{\infty}=0
\end{equation}

<p>
But the following operations are undefined:
</p>

\begin{equation}
\widetilde{\infty}\pm\widetilde{\infty}=\mathtt{NaN}
\end{equation}
\begin{equation}
\widetilde{\infty}/\widetilde{\infty}=\mathtt{NaN}
\end{equation}
\begin{equation}
\widetilde{\infty}/x=\widetilde{\infty}/0=\mathtt{NaN}
\end{equation}
\begin{equation}
\widetilde{\infty}\times0=0\times\widetilde{\infty}=\mathtt{NaN}
\end{equation}

<div class="puzzle" id="org58da89b">
<p>
Is this equivalent to defining \(\widetilde{\infty}=\lim_{w\to0}w^{-1}\)?
</p>

</div>
<div class="puzzle" id="org2c8b5c4">
<p>
Are these equations consistent? Do they lead to a contradiction?
</p>

</div>
</div>
</div>
<div id="outline-container-h-02fd2774-db86-4ec4-aa92-2257c9c0c77a" class="outline-2">
<h2 id="h-02fd2774-db86-4ec4-aa92-2257c9c0c77a"><span class="section-number-2">3.</span> History</h2>
<div class="outline-text-2" id="text-h-02fd2774-db86-4ec4-aa92-2257c9c0c77a">
<ul class="org-ul">
<li>John Wallis introduced the symbol \(\infty\) for infinity in his book
<i>De sectionibus conicis</i> (1655)</li>
<li>Isaac Newton wrote about them in his work
<i>De analysi per aequationes numero terminorum infinitas</i> (1699).</li>
<li>Wolfram claims Weierstrass was the first to treat infinity as a
quantity in 1876, though I cannot verify this; if true, it would either
be in his <i>Lecture courses on analytic functions</i> or
<i>Lecture courses on elliptic functions</i> (it seems like those were the
only things Weierstrass published in 1876).</li>
</ul>
</div>
</div>
<div id="outline-container-h-92c628a0-014d-40ef-9356-8ec5dfa417b3" class="outline-2">
<h2 id="h-92c628a0-014d-40ef-9356-8ec5dfa417b3"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-h-92c628a0-014d-40ef-9356-8ec5dfa417b3">
<ul class="org-ul">
<li>Michael Beeson and Freek Wiedijk
<a href="http://www.cs.ru.nl/~freek/pubs/limits.pdf">The meaning of infinity in calculus and computer algebra systems</a></li>
<li>Fredrik Johansson, <a href="https://fredrikj.net/blog/2021/01/infinity-in-calcium-and-fungrim/">Infinity in Calcium and Fungrim</a> (2021-01-25)</li>
<li>Mathematica Documentation about <a href="https://functions.wolfram.com/Constants/ComplexInfinity/introductions/Symbols/ShowAll.html"><code>ComplexInfinity</code></a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Mon, 31 May 2021 11:46:00 -0700
</div>
</body>
</html>
